main_menu = '''\nГлавное меню:
        1. Открыть файл
        2. Записать файл
        3. Показать контакт
        4. Добавить контакт
        5. Найти контакт
        6. Изменить контакт
        7. Удалить контакт
        8. Выход\n'''

imput_choice = 'Выбирите пункт меню: '
load_successful = 'Телефонная книга открыта'
load_error = 'Телефонная книга пуста или не открыта'
new_contact = 'Данные нового контакта'
input_contact = {'name': 'Введите имя: ',
                 'phone': 'Введите телефон: ',
                 'adress': 'Введите адрес: '}

